package com.example.demo.main;

import lombok.Getter;

/**
 * @Date: 2019/4/4
 * @Author: wu yang
 * @Description:
 */
@Getter
public enum FeeType {

    F001("F001","办公杂费","办公费"),
    F002("F002","办公电脑维修费","办公费"),
    F003("F003","办公家具","办公费"),
    F004("F004","快递费","办公费"),
    F005("F005","采购运输费","采购费用"),
    F006("F006","打板费","采购费用"),
    F007("F007","码头费","采购费用"),
    F008("F008","进口设备THC费用","采购费用"),
    F009("F009","进口设备港建费","采购费用"),
    F010("F010","进口报关费","采购费用"),
    F011("F011","进口关税","进口税费"),
    F012("F012","进口增值税","进口税费"),
    F013("F013","特殊采购费","特殊采购费"),
    F014("F014","样机采购","样机费"),
    F015("F015","仓储费","仓储费"),
    F016("F016","房租","租赁费"),
    F017("F017","租赁费","租赁费"),
    F018("F018","设备租赁费","租赁费"),
    F019("F019","承包活动费","承包活动费"),
    F020("F020","部门活动费","部门活动费"),
    F021("F021","党员活动费","党员费"),
    F022("F022","团员活动费","团员费"),
    F023("F023","电费（工业用）","电费（工业用）"),
    F024("F024","气费（工业用）","气费（工业用）"),
    F025("F025","水费（工业用）","水费（工业用）"),
    F026("F026","电费（生活区）","水电费"),
    F027("F027","水费（生活区）","水电费"),
    F028("F028","法律服务费","法律服务费"),
    F029("F029","废品处置费","废品处置"),
    F030("F030","提案改善","员工奖励"),
    F031("F031","评优评先","员工奖励"),
    F032("F032","阳光基金","阳光基金"),
    F033("F033","员工餐费","职工福利费"),
    F034("F034","员工体检","职工福利费"),
    F035("F035","员工班车费","员工班车费"),
    F036("F036","工会类费用","工会经费"),
    F037("F037","工会文体活动费","工会经费"),
    F038("F038","员工探望费","工会经费"),
    F039("F039","工会积分福利","工会经费"),
    F040("F040","工伤医疗（公司）","工伤医疗（公司）"),
    F041("F041","工伤医疗（社保局）","工伤医疗（社保局）"),
    F042("F042","商业保险费","商业保险费"),
    F043("F043","存货财产保险","财产保险费"),
    F044("F044","货运财产保险","财产保险费"),
    F045("F045","基建设备保险","财产保险费"),
    F046("F046","电视广告费","广告费"),
    F047("F047","报刊广告费","广告费"),
    F048("F048","电台广告费","广告费"),
    F049("F049","其他广告费","广告费"),
    F050("F050","会务费","会务费"),
    F051("F051","年费","年费"),
    F052("F052","检测调试费","检测调试"),
    F053("F053","市内交通费","交通费"),
    F054("F054","停车费","停车费"),
    F055("F055","燃油费","交通费"),
    F056("F056","车辆保险费","交通费"),
    F057("F057","厂内运输费","交通费"),
    F058("F058","零星采买布置费","节日布置"),
    F059("F059","绿化清洁费","绿化清洁费"),
    F060("F060","业务宣传费","业务宣传费"),
    F061("F061","展览费","展览费"),
    F062("F062","证件年检费","证件年检"),
    F063("F063","财务类审计费、验资费","财务审计费"),
    F064("F064","公司注册费","公司注册"),
    F065("F065","认证评审费","认证评审费"),
    F066("F066","招投标费用","书本"),
    F067("F067","软件费","软件费"),
    F068("F068","防伪税控年服务费","税控年服务"),
    F069("F069","通讯费","通讯费"),
    F070("F070","保安费","保安费"),
    F071("F071","维修费","维修费（成品库类型）"),
    F072("F072","物业管理费","物业管理费"),
    F073("F073","销售运输费","销售运输费"),
    F074("F074","修理装修费","修理装修费"),
    F075("F075","装卸费","装卸费"),
    F076("F076","出口招待费","出口招待费"),
    F077("F077","业务招待费","业务招待费"),
    F078("F078","成品库运输费（材料调拨）","运费-成品库专用"),
    F079("F079","成品库合同运输费（小家电支付）","运费-成品库专用"),
    F080("F080","成品库合同运输费（空调支付）","运费-成品库专用"),
    F081("F081","招聘费","招聘"),
    F082("F082","学历教育费","职工教育经费"),
    F083("F083","科技图书","职工教育经费"),
    F084("F084","培训费","职工教育经费"),
    F085("F085","培训杂费","职工教育经费"),
    F086("F086","特殊工种费","职工教育经费"),
    F087("F087","专利费","专利费"),
    F088("F088","京东自营运营费","平台运营费"),
    F089("F089","京东旗舰运营费","平台运营费"),
    F090("F090","天猫运营费","平台运营费"),
    F091("F091","苏宁运营费","平台运营费"),
    F092("F092","格力商城运菪费","平台运营费"),
    F093("F093","出口报关费","报关费"),
    F094("F094","出口检疫费","报关费"),
    F095("F095","出口理货费","报关费"),
    F096("F096","出口打单费","报关费"),
    F097("F097","出口港建费","报关费"),
    F098("F098","出口认证评审费","出口认证评审费"),
    F099("F099","出口加签费","加签费（出口）"),
    F100("F100","出口信用险保费","信用险保费"),
    F101("F101","信用证通知费","信用证通知费"),
    F102("F102","出口质量赔偿","质量赔款"),
    F103("F103","出口客户佣金","出口佣金"),
    F104("F104","出口运杂费","出口运杂费"),
    F105("F105","出口海运费","出口海运费"),
    F106("F106","固定资产（自购）","固定资产（自购）"),
    F107("F107","固定资产（代购）","固定资产（代购）"),
    F108("F108","基建（在建工程）","在建工程"),
    F109("F109","基建（代付）","基建（代付）"),
    F110("F110","附属类固定资产","附属类固定资产"),
    F111("F111","退保证金","退保证金"),
    F112("F112","付保证金","付保证金"),
    F113("F113","子公司资金预算款","子公司货款"),
    F114("F114","子公司货款","子公司货款")


    ;


    private String code;
    private String name;
    private String keyword;

    FeeType(String code, String name, String keyword) {
        this.code = code;
        this.name = name;
        this.keyword = keyword;
    }

}
